---
kind: property
id: P:Autodesk.Revit.DB.ACADExportOptions.ACAPreference
source: html/1a97e079-901e-56e0-252d-2b030d04e595.htm
---
# Autodesk.Revit.DB.ACADExportOptions.ACAPreference Property

The preferred way to generate geometry of ACA objects.
 Default value is ACAObjectPreference.Object.

## Syntax (C#)
```csharp
public ACAObjectPreference ACAPreference { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration